In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from numpy.random import randn

In [5]:
randn(3,3)

array([[ 0.12787953, -0.5261857 , -0.945804  ],
       [-0.42054552,  1.00428041, -0.1747691 ],
       [ 0.52418682,  0.3425294 , -0.71061095]])

In [6]:
df = pd.DataFrame(data =randn(3,3),index =["A","B","C"],columns = ["Clm1","Clm2","Clm3"])

In [10]:
df

       Clm1      Clm2      Clm3
A -0.894757  0.734595  0.258167
B -1.004805 -0.451855 -0.877999
C -0.247511 -0.940253  0.856613

## choose clm1

In [11]:
df["Clm1"]

A   -0.894757
B   -1.004805
C   -0.247511
Name: Clm1, dtype: float64

In [12]:
df["Clm3"]

A    0.258167
B   -0.877999
C    0.856613
Name: Clm3, dtype: float64

In [15]:
type(df["Clm1"])

pandas.core.series.Series

## Choose row  or index

In [17]:
df.loc["A"]

Clm1   -0.894757
Clm2    0.734595
Clm3    0.258167
Name: A, dtype: float64

In [18]:
df.loc["C"]

Clm1   -0.247511
Clm2   -0.940253
Clm3    0.856613
Name: C, dtype: float64

In [20]:
df[["Clm1","Clm3"]]

       Clm1      Clm3
A -0.894757  0.258167
B -1.004805 -0.877999
C -0.247511  0.856613

In [21]:
df

       Clm1      Clm2      Clm3
A -0.894757  0.734595  0.258167
B -1.004805 -0.451855 -0.877999
C -0.247511 -0.940253  0.856613

In [22]:
df["Clm4"] = pd.Series(randn(3),["A","B","C"])

In [23]:
df

       Clm1      Clm2      Clm3      Clm4
A -0.894757  0.734595  0.258167  0.814848
B -1.004805 -0.451855 -0.877999 -0.140412
C -0.247511 -0.940253  0.856613 -0.829054

In [24]:
df["Clm5"] =df["Clm1"]+df["Clm2"]+df["Clm3"]+df["Clm4"]

In [25]:
df

       Clm1      Clm2      Clm3      Clm4      Clm5
A -0.894757  0.734595  0.258167  0.814848  0.912852
B -1.004805 -0.451855 -0.877999 -0.140412 -2.475071
C -0.247511 -0.940253  0.856613 -0.829054 -1.160205

In [27]:
df.drop("Clm5",1)

       Clm1      Clm2      Clm3      Clm4
A -0.894757  0.734595  0.258167  0.814848
B -1.004805 -0.451855 -0.877999 -0.140412
C -0.247511 -0.940253  0.856613 -0.829054

In [28]:
df

       Clm1      Clm2      Clm3      Clm4      Clm5
A -0.894757  0.734595  0.258167  0.814848  0.912852
B -1.004805 -0.451855 -0.877999 -0.140412 -2.475071
C -0.247511 -0.940253  0.856613 -0.829054 -1.160205

In [29]:
df.drop("Clm5",1,inplace =True)

In [30]:
df

       Clm1      Clm2      Clm3      Clm4
A -0.894757  0.734595  0.258167  0.814848
B -1.004805 -0.451855 -0.877999 -0.140412
C -0.247511 -0.940253  0.856613 -0.829054

In [31]:
df["Clm1"]

A   -0.894757
B   -1.004805
C   -0.247511
Name: Clm1, dtype: float64

In [32]:
df.loc["B"]

Clm1   -1.004805
Clm2   -0.451855
Clm3   -0.877999
Clm4   -0.140412
Name: B, dtype: float64

In [33]:
df.iloc[0]

Clm1   -0.894757
Clm2    0.734595
Clm3    0.258167
Clm4    0.814848
Name: A, dtype: float64

In [36]:
df.loc["A","Clm1"]

-0.894756944665364

In [38]:
df.loc[["A","B"],["Clm1","Clm2"]]

       Clm1      Clm2
A -0.894757  0.734595
B -1.004805 -0.451855